autoklinika/workshop-ventilation-controller/firmware/sensor-node/sdkconfig.defaults
# Target: KAmod ESP32 POW RS485 (ESP32-WROOM-32D, 4 MB flash)
CONFIG_IDF_TARGET="esp32"

# Flash and partition layout
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# OTA A/B foundation and automatic rollback of an unconfirmed image
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# USB-C serial console through the on-board CH340.
# UART0 and 115200 bit/s are ESP-IDF defaults for this target.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Diagnostics and crash handling
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_CHECK_BOOT=y

# Runtime safety
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Keep the embedded C++ runtime deterministic and small
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
